Tekla Open API Reference for Tekla Structures 2025
Expression Class
 The Expression class represents an expression. This is a base class for other expressions and cannot be used directly.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Expression
 Tekla.Structures.Filtering.BinaryFilterExpressionItem
 Tekla.Structures.Filtering.DataFilterExpression
 Tekla.Structures.Filtering.FilterExpression
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public abstract class Expression
<SerializableAttribute>
Public MustInherit Class Expression
The Expression type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Overrides Object.ToString().)
Top
See Also
Reference
Tekla.Structures.Filtering Namespace